; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=64, remove_proportion=0.101, bases=25, instance_id=19, output=./training, seed=60

(define (problem warehouse-19)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 box62 box63 box64 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 base25 - base
    )
    (:init
        (to-remove box10)
        (to-remove box15)
        (to-remove box17)
        (to-remove box19)
        (to-remove box37)
        (to-remove box40)
        (clear box33)
        (on box33 box61)
        (on box61 box13)
        (on-base box13 base1)
        (clear box4)
        (on box4 box10)
        (on box10 box27)
        (on box27 box60)
        (on-base box60 base2)
        (clear box5)
        (on box5 box40)
        (on box40 box56)
        (on box56 box64)
        (on-base box64 base3)
        (clear box50)
        (on box50 box30)
        (on box30 box59)
        (on-base box59 base4)
        (clear box32)
        (on box32 box8)
        (on box8 box17)
        (on box17 box42)
        (on box42 box22)
        (on-base box22 base5)
        (clear box7)
        (on box7 box16)
        (on-base box16 base6)
        (clear box47)
        (on box47 box45)
        (on-base box45 base7)
        (clear box37)
        (on box37 box11)
        (on box11 box35)
        (on box35 box41)
        (on-base box41 base8)
        (clear box44)
        (on box44 box39)
        (on-base box39 base9)
        (clear box36)
        (on box36 box31)
        (on box31 box18)
        (on-base box18 base10)
        (clear box52)
        (on box52 box3)
        (on-base box3 base11)
        (clear box54)
        (on-base box54 base12)
        (clear box9)
        (on box9 box55)
        (on-base box55 base13)
        (clear box14)
        (on-base box14 base14)
        (clear box2)
        (on-base box2 base15)
        (clear box53)
        (on box53 box1)
        (on-base box1 base16)
        (clear box23)
        (on box23 box51)
        (on box51 box57)
        (on-base box57 base17)
        (clear box62)
        (on box62 box38)
        (on box38 box25)
        (on-base box25 base18)
        (clear box29)
        (on box29 box34)
        (on box34 box48)
        (on box48 box26)
        (on-base box26 base19)
        (clear box24)
        (on box24 box28)
        (on box28 box19)
        (on-base box19 base20)
        (clear box12)
        (on box12 box20)
        (on box20 box58)
        (on box58 box49)
        (on-base box49 base21)
        (clear box6)
        (on box6 box21)
        (on-base box21 base22)
        (clear box43)
        (on-base box43 base23)
        (clear box46)
        (on box46 box63)
        (on box63 box15)
        (on-base box15 base24)
        (clear-base base25)
    )
    (:goal (and 
        (removed box10)
        (removed box15)
        (removed box17)
        (removed box19)
        (removed box37)
        (removed box40)
    ))
)

; plan
1. (move box24 box28 box12)
   deleted: (clear box12) (on box24 box28)
   added: (on box24 box12) (clear box28)
   goals met: 0 of 6
2. (move box28 box19 box14)
   deleted: (clear box14) (on box28 box19)
   added: (on box28 box14) (clear box19)
   goals met: 0 of 6
3. (remove-from-base box19 base20)
   deleted: (on-base box19 base20) (clear box19)
   added: (removed box19) (clear-base base20)
   goals met: 1 of 6
4. (move box32 box8 box2)
   deleted: (clear box2) (on box32 box8)
   added: (on box32 box2) (clear box8)
   goals met: 1 of 6
5. (move box4 box10 box23)
   deleted: (clear box23) (on box4 box10)
   added: (on box4 box23) (clear box10)
   goals met: 1 of 6
6. (remove box10 box27)
   deleted: (on box10 box27) (clear box10)
   added: (removed box10) (clear box27)
   goals met: 2 of 6
7. (move box46 box63 box24)
   deleted: (clear box24) (on box46 box63)
   added: (on box46 box24) (clear box63)
   goals met: 2 of 6
8. (move box5 box40 box27)
   deleted: (clear box27) (on box5 box40)
   added: (on box5 box27) (clear box40)
   goals met: 2 of 6
9. (move box63 box15 box28)
   deleted: (clear box28) (on box63 box15)
   added: (on box63 box28) (clear box15)
   goals met: 2 of 6
10. (remove-from-base box15 base24)
   deleted: (on-base box15 base24) (clear box15)
   added: (removed box15) (clear-base base24)
   goals met: 3 of 6
11. (move box8 box17 box29)
   deleted: (clear box29) (on box8 box17)
   added: (on box8 box29) (clear box17)
   goals met: 3 of 6
12. (remove box17 box42)
   deleted: (on box17 box42) (clear box17)
   added: (removed box17) (clear box42)
   goals met: 4 of 6
13. (remove box37 box11)
   deleted: (on box37 box11) (clear box37)
   added: (removed box37) (clear box11)
   goals met: 5 of 6
14. (remove box40 box56)
   deleted: (on box40 box56) (clear box40)
   added: (removed box40) (clear box56)
   goals met: 6 of 6
